---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadCombination.SetUsageIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
source: html/d7dda504-e1c6-5561-f1c6-d9f50e32000b.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.SetUsageIds Method

Sets a collection of the load combination usage IDs.

## Syntax (C#)
```csharp
public void SetUsageIds(
	IList<ElementId> usageIds
)
```

## Parameters
- **usageIds** (`System.Collections.Generic.IList < ElementId >`) - A collection of the load combination usage IDs.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null